tutorials/straightPipe/openHFDIBRANS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 object 	 blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 	1.0; 

vertices 
( 
	 ( 0.0 0.0 0.0 )	// 000
	 ( 0.025 0.0 0.0 )	// 001
	 ( 0.025 0.01 0.0 )	// 002
	 ( 0.0 0.01 0.0 )	// 003
	 ( 0.0 0.0 0.0005 )	// 004
	 ( 0.025 0.0 0.0005 )	// 005
	 ( 0.025 0.01 0.0005 )	// 006
	 ( 0.0 0.01 0.0005 )	// 007
	 ( 0.125 0.0 0.0 )	// 008
	 ( 0.125 0.01 0.0 )	// 009
	 ( 0.125 0.0 0.0005 )	// 010
	 ( 0.125 0.01 0.0005 )	// 011
	 ( 0.125 0.015 0.0 )	// 012
	 ( 0.025 0.015 0.0 )	// 013
	 ( 0.125 0.015 0.0005 )	// 014
	 ( 0.025 0.015 0.0005 )	// 015
	 ( 0.025 -0.004999999999999999 0.0 )	// 016
	 ( 0.125 -0.004999999999999999 0.0 )	// 017
	 ( 0.025 -0.004999999999999999 0.0005 )	// 018
	 ( 0.125 -0.004999999999999999 0.0005 )	// 019
	 ( 0.15 0.0 0.0 )	// 020
	 ( 0.15 0.01 0.0 )	// 021
	 ( 0.15 0.0 0.0005 )	// 022
	 ( 0.15 0.01 0.0005 )	// 023
); 

edges 
( 
); 

blocks 
( 
	hex
		( 0  1  2  3  4  5  6  7)	( 50  20  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 1  8  9  2  5  10  11  6)	( 200  20  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 2  9  12  13  6  11  14  15)	lambdaZone	( 200  10  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 16  17  8  1  18  19  10  5)	lambdaZone	( 200  10  1)	simpleGrading 	( 1.0  1.0  1.0)

	hex
		( 8  20  21  9  10  22  23  11)	( 50  20  1)	simpleGrading 	( 1.0  1.0  1.0)

); 

boundary 
( 
	frontAndBack
	{
		type empty;
		faces
		(
			( 0  1  2  3)
			( 4  5  6  7)
			( 1  8  9  2)
			( 5  10  11  6)
			( 2  9  12  13)
			( 6  11  14  15)
			( 16  17  8  1)
			( 18  19  10  5)
			( 8  20  21  9)
			( 10  22  23  11)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			( 0  3  7  4)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			( 20  21  23  22)
		);
	}

	walls
	{
		type wall;
		faces
		(
			( 0  1  5  4)
			( 3  2  6  7)
			( 8  20  22  10)
			( 9  21  23  11)
		);
	}

	wallInsideLambda
	{
		type wall;
		faces
		(
			( 2  13  15  6)
			( 13  12  14  15)
			( 9  12  14  11)
			( 16  1  5  18)
			( 16  17  19  18)
			( 17  8  10  19)
		);
	}

); 

mergePatchPairs 
( 
); 

